using System;
using Telegram.Bot;
using Telegram.Bot.Args;
using Telegram.Bot.Types;
using Telegram.Bot.Types.Enums;
using Telegram.Bot.Types.ReplyMarkups;
using System.Runtime.InteropServices;
using System.Threading.Tasks;



namespace TelegramBotEGERus4
{
    public static class words
    {
        public static string[] w = {"агЕнт", "агронОмия", "акрОполь", "алкогОль", "алфавИт", "Амфора",
    "анАлог", "анАтом", "анонИм", "апокАлипсис", "арАхис", "арЕст", "аргумЕнт",
    "асимметрИя", "астрОлог", "астронОм", "атмосфЕра", "афЕра", "аэропОрты",
    "бАнты", "бАржА", "бОроду", "бУнгало", "балОванный", "балУясь", "баловАть",
    "блАговест", "блуднИца", "бралА", "бралАсь", "бухгАлтеров", "бюрокрАтия",
    "вЕрба", "вЕчеря", "вОвремя", "вОгнутый", "валовОй", "вандАлы", "вдовствО",
    "вернА", "вероисповЕдание", "вероисповЕдание", "ветеринАрия", "взАпуски",
    "взапертИ", "взялА", "взялАсь", "включЁн", "включЁнный", "включИм",
    "включИт", "включИшь", "влилАсь", "водопровОд", "воздухопровОд",
    "ворвалАсь", "воспринялА", "воспроизведЕние", "воссоздалА", "вручИт",
    "втрИдорога", "вчистУю", "гЕнезис", "гЕрбовый", "газопровОд",
    "гастронОмия", "гегемОния", "гипОтеза", "гналА", "гналАсь", "гомеопАтия",
    "граждАнство", "граждАнство", "грошОвый", "дОверху", "дОгмат", "дОнизу",
    "дОсуха", "дОсыта", "давнИшний", "дефИс", "дефИс", "диалОг", "диспансЕр",
    "диспансЕр", "добелА", "добралА", "добралАсь", "довезЁнный", "договОр",
    "договорЁнность", "дождалАсь", "дозИровать", "дозвонИтся", "дозвонЯтся",
    "докраснА", "докумЕнт", "докумЕнт", "донЕльзя", "донЕльзя", "досУг",
    "досУг", "дотрОнуться", "дремОта", "духовнИк", "евАнгелие", "еретИк",
    "еретИк", "жалюзИ", "жалюзИ", "ждалА", "жилОсь", "зАгнутый", "зАгодя",
    "зАгодя", "зАнял", "зАняло", "зАнятый", "зАсветло", "зАтемно", "завИдно",
    "завИдно", "завсегдАтай", "задОлго", "закУпорив", "закУпорить",
    "закУпорить", "занялА", "занятА", "запертА", "запломбировАть", "заселЁн",
    "звалА", "звонИм", "звонИт", "звонИшь", "зимОвщик", "злОба", "знАмение",
    "знАчимость", "знАчимый", "зубчАтый", "Издавна", "Иконопись", "Иксы",
    "Искоса", "искрА", "Исстари", "Исстари", "игУмен", "идеОлог", "иерОглиф",
    "изОгнутый", "избалОванный", "избаловАть", "издрЕвле", "изобретЕние",
    "импЕрский", "инАче", "инсУльт", "инстИнкт", "исключИт", "искривИться",
    "исчЕрпать", "кАмбала", "кАшлянуть", "кОнусы", "кОнусов", "кУхонный",
    "кУхонный", "каталОг", "каталОг", "каучУк", "квартАл", "квартАл",
    "кедрОвый", "киломЕтр", "киломЕтр", "клАла", "клЕить", "клЕить", "коклЮш",
    "корЫсть", "корЫсть", "кормЯщий", "крАлась", "крАны", "красИвее",
    "красИвейший", "кремЕнь", "кремЕнь", "кренИтся", "кровоточАщий",
    "кровоточИть", "лЕкторы", "лгалА", "лилА", "лилАсь", "ловкА", "ломОта",
    "ломОть", "лубОчный", "лыжнЯ", "мАркЕтинг", "мЕльком", "мЕстностей",
    "магазИн", "мастерскИ", "медикамЕнты", "метонИмия", "мозаИчный", "молОх",
    "молЯщий", "монолОг", "мусоропровОд", "мусоропровОд", "мытАрство",
    "нАискось", "нАчал", "нАчали", "нАчатый", "нЕдруг", "нЕнависть",
    "нЕнецкий", "нОвости", "новостЕй", "нОгтя", "наОтмашь", "навЕрх",
    "навралА", "наговОр", "надОлго", "наделИт", "надорвалАсь", "нажИвший",
    "нажИлся", "нажитА", "назвалАсь", "назлО", "накренИт", "налИвший",
    "налилА", "налитА", "намЕрение", "намЕрение", "нанЯвшийся", "нарОст",
    "нарОст", "нарвалА", "насорИт", "начАв", "начАвший", "начАвшись", "начАть",
    "начАть", "началА", "недУг", "незадОлго", "некролОг", "некролОг",
    "ненадОлго", "ненадОлго", "несказАнно", "нефтепровОд", "низИна",
    "низведЁн", "новоприбЫвший", "новорождЁнный", "обеспЕчение", "обеспЕчение",
    "обетовАнный", "обзвонИт", "облегчИт", "облегчИть", "облегчИть",
    "облилАсь", "обнаружЕние", "обнялАсь", "обогналА", "ободрЁн", "ободрЁнный",
    "ободрИть", "ободрИть", "ободрИшься", "ободралА", "ободренА",
    "обострЁнный", "обострИть", "объезднОй", "одОбренный", "одолжИт",
    "озвУчение", "озлОбить", "озлОбленный", "ознакОмленный", "оклЕить",
    "окружИт", "опОшлят", "оперИться", "опломбировАть", "определЁн", "оптОвый",
    "оптОвый", "освЕдомить", "освЕдомиться", "освЕдомишься", "осведомлЁнный",
    "остриЁ", "осужденА", "отбылА", "отдАв", "отдалА", "откУпорил",
    "откУпорить", "отключЁнный", "отозвалА", "отозвалАсь", "оторвалА",
    "Отрочество", "оценЁнный", "пАсквиль", "пЕтля", "пОнял", "пОручни",
    "пОстриг", "пУстошь", "пУстынь", "партЕр", "патриАрхия", "перезвонИт",
    "перекрОенный", "перелилА", "петлЯ", "пиццерИя", "плЕсневеть", "платО",
    "плодоносИть", "пломбировАть", "поИмка", "повторЁнный", "повторИт",
    "поделЁнный", "подзаголОвок", "поднЯв", "подрОстковый", "подчистУю",
    "позвалА", "позвонИт", "позвонИшь", "поискОвый", "полилА", "положИл",
    "положИть", "полтергЕйст", "понЯв", "понЯвший", "понялА", "портфЕль",
    "послАла", "прИбыл", "прИбыло", "прИкус", "прИнял", "прИняли", "прИнятый",
    "приручЁнный", "предвосхИтить", "премировАть", "прибЫв", "прибылА",
    "приговОр", "придАное", "призЫв", "принУдить", "принУдить", "принЯть",
    "приручЁнный", "прогИб", "прожИвший", "прозорлИва", "проторЁнный",
    "процЕнт", "процЕнт", "псевдонИм", "пулОвер", "пургА", "путепровОд",
    "рАджа", "рАпорт", "рОвненько", "рОзги", "развитОй", "ракУшка", "рвалА",
    "РевЕнь", "сЕтчатый", "сОгнутый", "сОгнутый", "сОздало", "сабО", "свЁкла",
    "свЁкла", "сверлИт", "сверлИшь", "сегмЕнт", "сирОты", "слИвовый", "снялА",
    "снятА", "созЫв", "созЫв", "создАвший", "создАл", "создалА", "создалА",
    "созданА", "сорИт", "сосредотОчение", "срЕдства", "срЕдствами", "стАтуя",
    "столЯр", "столЯр", "тАинство", "тОртов", "тОрты", "тОтчас", "тУфля",
    "табУ", "тамОжня", "танцОвщица", "твОрОг", "тигрОвый", "толИка", "тошнотА",
    "трУбчатый", "трубопровОд", "убралА", "убыстрИть", "углубИть", "углубИть",
    "уговОр", "узаконЕние", "украИнский", "укрепИт", "умЕрший", "упрОчение",
    "факсИмиле", "фетИш", "флюорогрАфия", "ходАтайство", "цЕнтнер", "цемЕнт",
    "цепОчка", "чЕрпать", "чИстильщик", "шАрфы", "шофЁр", "щЁлкать",
    "щИколотка", "щавЕль", "щемИт", "экспЕрт", "Экскурс", "электропрОвод",
    "дешевИзна", "кремнЯ", "лЕкторов", "пОчестей", "чЕлюстей", "нОготь",
    "позЫв", "отзЫв посла", "Отзыв на публикацию", "школЯр", "киоскЁр",
    "контролЁр", "баловАться", "разбаловАть", "бАловень судьбы", "малЯр",
    "включИть", "воспринЯть", "воссоздАть", "вручИть", "зАняли", "заперлА",
    "заперлАсь", "звонИть", "накренИться", "насорИть", "смазлИва", "суетлИва",
    "болтлИва", "прожОрлива", "обзвонИть", "облИться", "обнЯться",
    "ободрИться", "формировАть", "нормировАть", "сортировАть", "опОшлить",
    "послАла", "прибЫть", "прИбыл", "прИбыло", "принялА", "сорвалА", "защемИт",
    "заселЁнный", "заселенА", "нАжитый", "начатА", "низведЁнный"};
    }
    class Program
    {
        static ITelegramBotClient botClient;
        static void Main(string[] args)
        {
            botClient = new TelegramBotClient("1896470123:AAG9NuJX8Qt_Zyddw7KDX8y6fjSVcyNuBA0");
            var me = botClient.GetMeAsync().Result;
            (new DataManager()).CreateDB();

            botClient.OnMessage += Bot_OnMessage;
            StartReceivingAsync();

            Console.WriteLine("Press Escape to quit:");
            ConsoleKeyInfo key;
            do
            {
                key = Console.ReadKey();
            } while (key.Key != ConsoleKey.Escape);

            botClient.StopReceiving();
        }

        static void Bot_OnMessage(object sender, MessageEventArgs e)
        {
            if (e.Message.Text != null)
            {
                (new TaskManager()).OnMessage(botClient, e);
            }
        }

        private static async void StartReceivingAsync()
        {
            Console.WriteLine("Receiving is starting...");
            await Task.Run(()=>{ botClient.StartReceiving(); });
            Console.WriteLine("Receiving messages has been started");
        }
    }
}
